renesas/rx-driver-package/source/r_mmcif_rx/r_mmcif_rx_vx.xx/r_mmcif_rx/src/targets/rx65n/r_mmcif_dev.c
    return MMC_SUCCESS;
}


/**********************************************************************************************************************
* Outline      : Disable ICU
* Function Name: r_mmcif_dev_disable_int
* Description  : Disables the Interrupt Request Enable (IENn).
* Arguments    : uint32_t           channel             ;   MMC Channel No.
* Return Value : MMC_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_disable_int(uint32_t channel)
{
#ifdef MMC_CFG_USE_FIT
#if (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT)
    uint32_t ipl = 0;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
#endif  /* (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT) */
#endif /* MMC_CFG_USE_FIT */

    if (MMC_CH0 == channel)
    {
#if defined(MMC_CFG_CH0_INCLUDED)
        R_BSP_InterruptRequestDisable(VECT(MMCIF,MBFAI));
        if (0 == IEN(MMCIF,MBFAI))
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#if (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT)
        /* ---- Disable interrupt request (IENn) of IER. ---- */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
        ICU.GENBL1.BIT.EN8  = 0;       /* MMC ACCI */
        ICU.GENBL1.BIT.EN7  = 0;       /* MMC ERRI */
        ICU.GENBL1.BIT.EN6  = 0;       /* MMC CDTEI */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
        if (0 == ICU.GENBL1.BIT.EN6)
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#ifdef MMC_CFG_USE_FIT
        ipl = 0;
        R_BSP_InterruptControl(BSP_INT_SRC_BL1_MMCIF_CDETIO, BSP_INT_CMD_GROUP_INTERRUPT_DISABLE, (void *)&ipl);
#else
        R_BSP_InterruptRequestDisable(VECT(ICU,GROUPBL1));
        IPR(ICU,GROUPBL1)  = 0;
#endif /* MMC_CFG_USE_FIT */
#endif  /* (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT) */
        IPR(MMCIF,MBFAI)    = 0;
        if (0 == IPR(MMCIF,MBFAI))
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#endif  /* MMC_CFG_CH0_INCLUDED */
    }
    else    /* MMC_CH1 */
    {
#if defined(MMC_CFG_CH1_INCLUDED)
        R_BSP_InterruptRequestDisable(VECT(MMCIF,MBFAI));
        if (0 == IEN(MMCIF,MBFAI))
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
    #if (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT)
        /* ---- Disable interrupt request (IENn) of IER. ---- */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
        ICU.GENBL1.BIT.EN8  = 0;       /* MMC ACCI */
        ICU.GENBL1.BIT.EN7  = 0;       /* MMC ERRI */
        ICU.GENBL1.BIT.EN6  = 0;       /* MMC CDTEI */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
        if (0 == ICU.GENBL1.BIT.EN6)
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#ifdef MMC_CFG_USE_FIT
        ipl = 0;
        R_BSP_InterruptControl(BSP_INT_SRC_BL1_MMCIF_CDETIO, BSP_INT_CMD_GROUP_INTERRUPT_DISABLE, (void *)&ipl);
#else
        R_BSP_InterruptRequestDisable(VECT(ICU,GROUPBL1));
        IPR(ICU,GROUPBL1)  = 0;
#endif /* MMC_CFG_USE_FIT */
#endif  /* (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT) */
        IPR(MMCIF,MBFAI)    = 0;
        if (0 == IPR(MMCIF,MBFAI))
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#endif  /* MMC_CFG_CH1_INCLUDED */
    }

    return MMC_SUCCESS;
}


/**********************************************************************************************************************
* Outline      : Enable ICU
* Function Name: r_mmcif_dev_enable_int
* Description  : Enables the Interrupt Request Enable (IENn).
* Arguments    : uint32_t           channel             ;   MMC Channel No.
* Return Value : MMC_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_enable_int(uint32_t channel)
{
#if (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT)
#ifdef MMC_CFG_USE_FIT
    uint32_t ipl = 0;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
#endif /* MMC_CFG_USE_FIT */
#endif  /* (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT) */

    if (MMC_CH0 == channel)
    {
#if defined(MMC_CFG_CH0_INCLUDED)
        IPR(MMCIF,MBFAI)    = MMC_CFG_CH0_INT_LEVEL_DMADTC;
#if (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT)
        /* ---- Enable interrupt request (IENn) of IER. ---- */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
        ICU.GENBL1.BIT.EN6  = 1;       /* MMC CDTEI */
        ICU.GENBL1.BIT.EN7  = 1;       /* MMC ERRI */
        ICU.GENBL1.BIT.EN8  = 1;       /* MMC ACCI */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */        
        if (1 == ICU.GENBL1.BIT.EN8)
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#ifdef MMC_CFG_USE_FIT
        ipl = MMC_CFG_CH0_INT_LEVEL;
        R_BSP_InterruptControl(BSP_INT_SRC_BL1_MMCIF_CDETIO, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *)&ipl);
#else
        IPR(ICU,GROUPBL1)  = MMC_CFG_CH0_INT_LEVEL;
        R_BSP_InterruptRequestEnable(VECT(ICU,GROUPBL1));
#endif  /* MMC_CFG_USE_FIT */
#endif  /* (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT) */
        R_BSP_InterruptRequestEnable(VECT(MMCIF,MBFAI));
        if (1 == IEN(MMCIF,MBFAI))
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#endif  /* MMC_CFG_CH0_INCLUDED */
    }
    else    /* MMC_CH1 */
    {
#if defined(MMC_CFG_CH1_INCLUDED)
        IPR(MMCIF,MBFAI)    = MMC_CFG_CH1_INT_LEVEL_DMADTC;
#if (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT)
        /* ---- Enable interrupt request (IENn) of IER. ---- */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
        ICU.GENBL1.BIT.EN6  = 1;       /* MMC CDTEI */
        ICU.GENBL1.BIT.EN7  = 1;       /* MMC ERRI */
        ICU.GENBL1.BIT.EN8  = 1;       /* MMC ACCI */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
        if (1 == ICU.GENBL1.BIT.EN8)
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#ifdef MMC_CFG_USE_FIT
        ipl = MMC_CFG_CH1_INT_LEVEL;
        R_BSP_InterruptControl(BSP_INT_SRC_BL1_MMCIF_CDETIO, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *)&ipl);
#else
        IPR(ICU,GROUPBL1)  = MMC_CFG_CH1_INT_LEVEL;
        R_BSP_InterruptRequestEnable(VECT(ICU,GROUPBL1));
#endif  /* MMC_CFG_USE_FIT */
#endif  /* (MMC_CFG_DRIVER_MODE & MMC_MODE_HWINT) */
        R_BSP_InterruptRequestEnable(VECT(MMCIF,MBFAI));
        if (1 == IEN(MMCIF,MBFAI))
        {
            R_BSP_NOP();  /* Wait for the write completion. */
        }
#endif  /* MMC_CFG_CH1_INCLUDED */
    }

